openfoam/swirlingJet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 -1);

boundaryField
{
    rotor
    {
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;
      type            fixedValue;
//        value           uniform (0 0 1);

 value           nonuniform List<vector> 
4560
(
(-2.029403755830014371e-18 7.637964394084838238e-02 1.000000000000000000e+00)
(-8.274283981011187894e-02 1.588810593567193674e-01 1.000000000000000000e+00)
(-1.784828036073216884e-01 2.540585677806681542e-01 1.000000000000000000e+00)
(-2.875132773243910256e-01 3.620474985496123788e-01 1.000000000000000000e+00)
(-4.085473938557766527e-01 4.813367954407914984e-01 1.000000000000000000e+00)
(-5.372901284379908438e-01 6.073119590175137805e-01 1.000000000000000000e+00)
(-6.639861105526335683e-01 7.297786085981188275e-01 1.000000000000000000e+00)
(-7.692890757156336523e-01 8.287713286452668138e-01 1.000000000000000000e+00)
...
(1.615743795094136404e-02 1.613872034450025694e-02 1.000000000000000000e+00)

);
    }

    stator
    {
//	type noSlip;
        type            inletOutlet;
 inletValue      uniform (0 0 1);

    }

    shroud1
    {
        //type            fixedValue;
       //value           uniform (0 0 0);
	type slip;
//	type noSlip;
//type rotatingWallVelocity;
//origin (0 0 0);
//axis (0 0 1);
//omega 1;

    }



}

// ************************************************************************* //
