openfoam/swirlingJet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    rotor
    {
        //type            kqRWallFunction;
        //value           uniform 0.00001; //1e-5
        type            fixedValue;
        value           uniform 0.01;

    }
    shroud
    {
//        type            kqRWallFunction;
//        value           uniform 0.00001; //1e-5
        type            fixedValue;
        value           uniform 0.00;
//        type            zeroGradient;


    }
    hub
    {
//        type            kqRWallFunction;
//        value           uniform 0.00001; //1e-5
        type            zeroGradient;
  //      type            fixedValue;
//        value           uniform 0.00;

    }
    stator
    {
//        type            kqRWallFunction;
  //      value           uniform 0.00001; //1e-5
//        type            fixedValue;
  //      value           uniform 0.01;
type zeroGradient;

    }
    inlet
    {
        //type            fixedValue;
        //value           uniform 0.01;
//type cyclic;
//	        type            fixedValue;
type zeroGradient;
//       value           uniform 0.0;

    }
    outlet
    {
        //type            freestream;
       //freestreamValue uniform 0.01;
	        type            fixedValue;
       value           uniform 0.0;
//type cyclic;
    }

}


// ************************************************************************* //
